tutorials/CFD/27SmagorinskyHyperreduction/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "500";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
11644
(
(1.0000696 -0.00017907839 6.5046829e-43)
(1.0000647 -0.00053155288 6.8830645e-43)
(1.0000654 -0.00088162571 6.8133087e-43)
(1.0000657 -0.0012350483 4.7249587e-43)
(1.0000656 -0.0015887357 -3.7153553e-41)
(1.0000648 -0.001940953 9.7770327e-40)
(1.000063 -0.0022872178 3.9807335e-37)
(1.0000598 -0.0026209598 1.0040573e-35)
...
)
;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }
    outlet
    {
        type            zeroGradient;
    }
    down
    {
        type            symmetryPlane;
    }
    up
    {
        type            symmetryPlane;
    }
    sides
    {
        type            slip;
    }
    cylinder1
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
